#+title: Bandits in the bank 
#+author: Cyril Godart 
# #+REVEAL_ROOT:  https://cdn.jsdelivr.net/npm/reveal.js@3.7
# #+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
# #+REVEAL_ROOT:  file:///Users/cyril.godart/Dropbox/Professional/Presentations/BanditsIntheBank/reveal.js/dist/reveal.js
#+REVEAL_PLUGINS: (highlight)
#+OPTIONS: toc:nil reveal_mathjax:t
#+OPTIONS: num:nil
# #+REVEAL_THEME: night_modified
#+REVEAL_TRANS: convex 
#+REVEAL_MAX_SCALE: 1 
#+REVEAL_MARGIN: 0.00 
#+OPTIONS: reveal_center:t 
#+OPTIONS: reveal_rolling_links:t
#+OPTIONS: reveal_keyboard:t 
#+OPTIONS: reveal_overview:t 
#+OPTIONS: reveal_rolling_links:t reveal_keyboard:t reveal_overview:t 
#+OPTIONB: toc:nil 
#+OPTIONS: reveal_mathjax:t
# #+OPTIONS: ^:nil 
#+LATEX_HEADER: \usepackage{amssymb,amsmath}
#+LATEX_HEADER: \DeclareRobustCommand{\Esp}[1]{\ensuremath{\mathbb{E}\left[#1\right]}}
#+LATEX_HEADER: \DeclareRobustCommand{\Prob}[1]{\ensuremath{\mathbb{P}\left[#1\right]}}
#+LATEX_HEADER: \DeclareRobustCommand{\Var}[1]{\ensuremath{\mathbb{V}\left[#1\right]}}
#+LATEX_HEADER: \DeclareRobustCommand{\TransfLaplace}[1]{\ensuremath{\mathcal{L}\left[#1\right]}}
#+LATEX_HEADER: \DeclareRobustCommand{\DistNorm}[2]{\ensuremath{\mathcal{N}\left(#1,#2\right)}}
#+LATEX_HEADER: \DeclareRobustCommand{\distribuee}{\ensuremath{\sim}}
** Table of results
| Scenario          | Nb RFQs |     TS | esp-greedy cst | eps-greedy var |  UCB1 | A/B Test |
|-------------------+---------+--------+----------------+----------------+-------+----------|
| Deterministic     |     500 |    2.5 |            6.5 |              3 |    11 |      7.5 |
| Det. with switch  |    3000 |     70 |             70 |             60 |   110 |      160 |
| Switch with noise |    3000 |    120 |            120 |            110 |   150 |      160 |
| Periodic          |    3000 |     50 |             60 |            150 |    80 |       40 |
|-------------------+---------+--------+----------------+----------------+-------+----------|
| Average           |         | 60.625 |         64.125 |          80.75 | 87.75 |   91.875 |
#+TBLFM: @6$7=vmean(@2..@5)::@6$4=vmean(@2..@5)::@6$5=vmean(@2..@5)::@6$6=vmean(@2..@5)::@6$3=vmean(@2..@5)
